#### 데이터 탐색을 위한 기술 통계 분석 실습
#### 1. 기술 통계량 확인하기

In [1]:
# 데이터 로드

In [2]:
from itertools import groupby

import pandas as pd
import os

In [3]:
print(os.getcwd())

C:\Users\1\Desktop\workspace\core-project-study\jinseok\python-study\hr데이터_기초통계분석

In [5]:
# 작업 디렉토리 변경
os.chdir('C:\\Users\\1\\Desktop\\workspace\\core-project-study\\jinseok\\python-study\\data')

In [7]:
print(os.getcwd())

C:\Users\1\Desktop\workspace\core-project-study\jinseok\python-study\data

In [10]:
hr_info = pd.read_csv('hr-info.csv', encoding='euc-kr')
hr_info

,EID,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
0,E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
1,E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
2,E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
3,E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
4,E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
196,E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
197,E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
198,E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
199,E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [11]:
# 기술 통계량 확인
hr_info.describe()

,AGE,SERVICE_YEAR,PERFORMANCE_SCORE,SALARY,TRAINING_HOURS
count,200.000000,200.000000,200.000000,200.000000,200.000000
mean,31.930000,4.660000,1.919900,5987.000000,34.745000
std,7.111114,6.183492,1.748062,1182.676889,40.470971
min,22.000000,0.000000,0.000000,4500.000000,0.000000
25%,27.000000,0.000000,0.000000,5000.000000,4.000000
50%,30.000000,1.000000,1.795000,5600.000000,21.000000
75%,37.000000,8.000000,3.412500,6825.000000,56.750000
max,49.000000,25.000000,4.960000,10200.000000,240.000000

In [12]:
hr_info.columns

Index(['EID', 'ENAME', 'GENDER', 'ORG_CD', 'POS_CD', 'AGE', 'SERVICE_YEAR',
       'EDU_LEVEL', 'PERFORMANCE_SCORE', 'SALARY', 'LAST_PROMO_DT',
       'TRAINING_HOURS', 'SKILLS', 'ACTIVE_STATE', 'HIRE_DATE', 'RETIRE_DATE',
       'RETIRE_REASON', 'REHIRE_YN', 'NATION', 'ROUNDING_DEDUCTION'],
      dtype='object')

In [13]:
hr_info.describe(include=['object'])

,EID,ENAME,GENDER,ORG_CD,POS_CD,EDU_LEVEL,LAST_PROMO_DT,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
count,200,200,200,197,200,200,182,200,200,200,49,49,49,200,200
unique,200,200,2,30,9,5,4,91,2,16,8,6,2,6,2
top,E00206,시이오,M,ORG023,P008,학사 학위,2024-03-01,Salesforce,Y,2024-03-01,2024-03-01,이직,N,KOREA,Y
freq,1,1,117,12,55,159,111,24,151,64,19,28,45,102,150

#### 2. 통계 값 개별로 확인

In [14]:
# 전체 총 지출 인건비를 확인
hr_info['SALARY'].sum()

np.int64(1197400)

In [15]:
# 평균 연봉
hr_info['SALARY'].mean()

np.float64(5987.0)

In [19]:
# 퇴사한 사람 수 확인
# count()
# 결측치는 계산에 포함하지 않음
hr_info['RETIRE_DATE'].count()

np.int64(49)

In [21]:
# 남 / 여 비율 확인
hr_info['GENDER'].value_counts()

GENDER
M    117
F     83
Name: count, dtype: int64

In [27]:
# 직원들의 국적 종류
hr_info['NATION'].unique()

# 어레이에 담아줌

array(['KOREA', 'Japan', 'USA', 'India', 'China', 'UK'], dtype=object)

In [29]:
# 최대 근속 년수
hr_info['SERVICE_YEAR'].max()

np.int64(25)

In [30]:
# 최소 근속 년수
hr_info['SERVICE_YEAR'].min()

np.int64(0)

In [32]:
hr_info['SERVICE_YEAR'].median()

np.float64(1.0)

In [41]:
edu_list = hr_info['EDU_LEVEL'].unique()

In [39]:
# 박사 학위 취득자의 평균 연봉을 알아보자
hr_info[hr_info['EDU_LEVEL'] == '박사 학위']['SALARY'].mean()

np.float64(8166.666666666667)

In [52]:
# 교육수준별 연봉을 출력(반복문)
for edu_level in edu_list:
    print(edu_level, ' : ',  hr_info[hr_info['EDU_LEVEL']== edu_level]['SALARY'].mean())

박사 학위  :  8166.666666666667
학사 학위  :  5727.044025157233
석사 학위  :  6900.0
고등학교 졸업  :  6140.0
전문대 학위  :  5050.0

#### 3. 데이터 그룹화를 이용한 통계분석
- groupby

In [56]:
# 교육 수준별 연봉
hr_info[['SALARY', 'EDU_LEVEL']].groupby(['EDU_LEVEL']).mean()

                SALARY
EDU_LEVEL
고등학교 졸업    6140.000000
박사 학위      8166.666667
석사 학위      6900.000000
전문대 학위     5050.000000
학사 학위      5727.044025

In [57]:
hr_info[['SALARY', 'EDU_LEVEL', 'GENDER']].groupby(['EDU_LEVEL', 'GENDER']).mean()

                       SALARY
EDU_LEVEL GENDER
고등학교 졸업   F       6200.000000
          M       6100.000000
박사 학위     F       8425.000000
          M       8037.500000
석사 학위     F       7233.333333
          M       6525.000000
전문대 학위    F       5600.000000
          M       4500.000000
학사 학위     F       5643.076923
          M       5785.106383

In [59]:
hr_info.columns

Index(['EID', 'ENAME', 'GENDER', 'ORG_CD', 'POS_CD', 'AGE', 'SERVICE_YEAR',
       'EDU_LEVEL', 'PERFORMANCE_SCORE', 'SALARY', 'LAST_PROMO_DT',
       'TRAINING_HOURS', 'SKILLS', 'ACTIVE_STATE', 'HIRE_DATE', 'RETIRE_DATE',
       'RETIRE_REASON', 'REHIRE_YN', 'NATION', 'ROUNDING_DEDUCTION'],
      dtype='object')

#### 그룹화 후 컬럼별로 다른 연산

In [60]:
hr_info.groupby('NATION').agg({'PERFORMANCE_SCORE' : 'mean', 'SALARY' : 'max'})

        PERFORMANCE_SCORE  SALARY
NATION
China            2.550000    7400
India            1.854545    8300
Japan            2.672381    8600
KOREA            1.461765   10200
UK               2.692778    7300
USA              2.329091    8500

#### 4. 상관계수 분석
- 두 변수 사이의 관계를 수치화 하여 보는 방법

분산
- 확률 변수가 기댓값으로부터 얼마나 떨어진 곳에 분포하는지 가늠하는 숫자
- 편차 제곱의 평균

표준 편차
 - 분산의 제곱근

• 데이터 : x1,x2,…,Xn

• 평균 : x̄

• 편차 : (x1 - x̄), (x2 - x̄), ... , (xn - x̄)
• 편차들의 합 : (x1 -x̄) + (x2 - x̄) + …+ (xn -x̄) = ?

• 분산 : (x1-x̄)^2+(x2-x̄)^2+…+(xn-x̄)^2 / n-1

공분산
- 하나의 변수가 아닌, 두개의 변수로 구한 분산 값

공분산 = Cov[X, Y] = E[(X-X̄)(Y- Ȳ)] = 0XY

= Σ (xi - X̄)(Yi - Ȳ) / n

##### 공분산 값의 문제
##### 공분산은 데이터의 스케일에 영향을 받음

##### ex) 키(cm), 몸무게(kg)의 공분산 200
##### ex) 시력, 눈의 굴절률의 공분산 2

##### 공분산을 정규화 (스케일링을 함) -> 상관계수

참고 : 상관계수 해석의 일반적인 가이드
Irl = 절대값
0.0 <= |r| < 0.2 : 상관관계가 없다. = 선형의 관계가 없다.
0.2 <= |r] < 0.4 : 약한 상관관계가 있다.
0.4 <= |r| < 0.6 : 보통의 상관관계가 있다.
0.6 <= |r| < 0.8 : 강한 (높은) 상관관계가 있다.
0.8 <= |r| <= 1.0 : 매우 강한 (매우 높은) 상관관계가 있다.

In [62]:
# 상관계수가 1에 가깝다 : 강한 선형관계, A형 변수 증가하면 B 변수도 증가 ( 양의 선형 상관관계 )
# 상관계수가 -1에 가깝다 : 강한 선형관계, A변수가 증가하면 B 변수 감소 ( 음의 선형 상관관계 )

In [66]:
# 직원 성과 평가 점수와 연봉의 상관계수 확인
hr_info[['PERFORMANCE_SCORE', 'SALARY']].corr()

                   PERFORMANCE_SCORE    SALARY
PERFORMANCE_SCORE           1.000000  0.609152
SALARY                      0.609152  1.000000

In [67]:
# 수치데이터들의 상관계수 확인
hr_info[ [ 'PERFORMANCE_SCORE', 'SALARY', 'AGE', 'SERVICE_YEAR', 'TRAINING_HOURS' ]]. corr()

,PERFORMANCE_SCORE,SALARY,AGE,SERVICE_YEAR,TRAINING_HOURS
PERFORMANCE_SCORE,1.000000,0.609152,0.582203,0.492801,0.551200
SALARY,0.609152,1.000000,0.961699,0.970875,0.628931
AGE,0.582203,0.961699,1.000000,0.932563,0.575867
SERVICE_YEAR,0.492801,0.970875,0.932563,1.000000,0.559911
TRAINING_HOURS,0.551200,0.628931,0.575867,0.559911,1.000000

In [ ]:
# 연봉과, 나이 / 연봉과 근속년수는 강한 양의 선형 상관관계가 잇구나
# 나이와 근속 연수가 클수록 연봉이 크다.